podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/CT16B0_LPC11Cxx.svd.xml
            <register>
               <name>PWMC</name>
               <description>PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT16B0_MAT[2:0]</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>PWMEN0</name>
                     <description>PWM channel0 enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EM0</name>
                           <description>CT16Bn_MAT0 is controlled by EM0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMMODE</name>
                           <description>PWM mode is enabled for CT16Bn_MAT0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN1</name>
                     <description>PWM channel1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EM1</name>
                           <description>CT16Bn_MAT1 is controlled by EM1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMMODE</name>
                           <description>PWM mode is enabled for CT16Bn_MAT1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN2</name>
                     <description>PWM channel2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EM2</name>
                           <description>Match channel 2 or pin CT16B0_MAT2 is controlled by EM2. Match channel 2 is not pinned out on timer 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMMODE</name>
                           <description>PWM mode is enabled for match channel 2 or pin CT16B0_MAT2</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMEN3</name>
                     <description>PWM channel3 enable Note: It is recommended to use match channel 3 to set the PWM cycle because it is not pinned out</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EM3</name>
                           <description>Match channel 3 match channel 3 is controlled by EM3</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWMMODE</name>
                           <description>PWM mode is enabled for match channel 3match channel 3</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
